tests/com/l7tech/service/resources/wssInterop/simpleRequest.xml

<soap:Envelope xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
 <soap:Header>
     <PingHeader xmlns="http://xmlsoap.org/Ping">Layer 7 Technologies - Scenario #8</PingHeader>
 </soap:Header>
 <soap:Body wsu:Id="Body">
     <Ping xmlns="http://xmlsoap.org/Ping">Layer 7 Technologies - Scenario #8</Ping>
 </soap:Body>
</soap:Envelope>